# EM Lyon - Python coding bootcamp - Session 2

1. **Introduction**
2. **Pandas data structures: Series and DataFrame**
3. **Accessing to data**
4. Data management and processing
5. Data Visualisation
6. Statistical analysis

&#169; 2018 Yotta Conseil

# 1. Introduction


## 1.1 Presentation of the dataset

This session uses the data available on the US Social Security web site: https://www.ssa.gov/oact/babynames/limits.html

We will use the national dataset `names.zip`.

### Read me provided by SSA:

> For each year of birth YYYY after 1879, we created a comma-delimited file called yobYYYY.txt. Each record in the individual annual files has the format "name,sex,number", where name is 2 to 15 characters, sex is M (male) or F (female) and "number" is the number of occurrences of the name. Each file is sorted first on sex and then on number of occurrences in descending order. When there is a tie on the number of occurrences, names are listed in alphabetical order. (...)
> To safeguard privacy, we restrict our list of names to those with at least 5 occurrences.

In [8]:
!pwd

/Users/dalyaertekin/Desktop

In [9]:
import
ps.getcwd()

SyntaxError: invalid syntax (<ipython-input-9-852416a5f5df>, line 1)

## 1.2 Importing the necessary modules

We will start by using the `pandas` module.

We use the Python `import` statement followed by the name of the module. After being imported the name of the module is know in the Python environement and the user can access to any of its attributes by using the *dot* operator materialized by a point: `.`.

Example, accessing to the version number of a Python module:
```python
import pandas
print(pandas.__version__)
```

Python allows also to rename a module using the `as` keyword followed by another name, generally shorter than the original one.

In [10]:
# import pandas and name the module 'pd'
import pandas as pd
print(pd.__version__)

0.23.4

In [7]:
# pandas is unkown since it has been renamed as 'pd' when imported
#pandas

In [14]:
pd?

<div class="alert alert-info">
<b>Tip</b>
<ul>
    <li>In Jupyter notebook, you can get an help by following any know symbol by using the question mark operator: `?`.</li>
    <li>It opens a pop up window with a text written by developers and intended to help users.</li>
</ul>
</div>

In [11]:
# display options
pd.set_option("display.max_rows", 16)
pd.set_option("display.max_columns", 30)

## 1.3 Loading a single file

`pandas` is equiped with the `read_csv()` function which enables to load CSV files.

In order to understand how to use the `read_csv()` function, here again we can use the `?` operator.

In [5]:
pd.read_csv?

Object `pd.read_csv` not found.

Reading a file with `pandas` is performed with a single statement and the appropriate arguments:
- file path
- column names

In [15]:
# loading the 2017 file
df2017 = pd.read_csv('names/yob2017.txt', names=['name', 'gender', 'births'])
df2017

            name gender  births
0           Emma      F   19738
1         Olivia      F   18632
2            Ava      F   15902
3       Isabella      F   15100
4         Sophia      F   14831
5            Mia      F   13437
6      Charlotte      F   12893
7         Amelia      F   11800
...          ...    ...     ...
32461       Zyel      M       5
32462     Zyheem      M       5
32463     Zyhier      M       5
32464      Zykai      M       5
32465     Zykeem      M       5
32466      Zylin      M       5
32467      Zylis      M       5
32468      Zyrie      M       5

[32469 rows x 3 columns]

The result is a `DataFrame` object which is assigned to a variable. It denotes the object which has been assigned to it. This 
`DataFrame` object has 32.469 rows and 3 columns.

There are many other functions which aim is to import data according to different formats. One can type `pd.read` and  then press the `Tab` key. Jupyter displays a list of available functions starting with `read`. One can select the appropriate function by using the up and down arrows. Press `Esc` to exit the list.

In [25]:
pd.read_clipboard # press Tab key and Esc to exit from the list

function | usage
-|-
read_clipboard | read data from memory
read_csv | read data from a CSV file (Comma-Separated Value)
read_excel | read data from an Excel workbook
read_html | read data from an HTML file (search for < table > tags)
read_json | read data from a JSON file (JavaScript Object Notation)
read_sql | read data from an SQL query
read_sas | read data from a SAS file
read_table | read data from a tabular file

All of these functions contains a large number of options - through keywords arguments with default values - and which enable to adapt the behavior of the function to the real data to be processed.

<div class="alert alert-warning">
**Further reading**
<ul>
    <li>For most of `read_xxx()` functions, a `to_xxx()` functions exist and export the `DataFrame` object to the appropriate format, see: http://pandas.pydata.org/pandas-docs/stable/io.html</li>
</ul>
</div>

## 1.4 Loading all files

We are going to import all data from all files and not a single one.

This is done with a small script that is out of scope for the moment. It has to loop on all files in order to build a large `DataFrame`which includes a fourth column with each year.

We are only interessed in the result of the script.

In [19]:
# Import all data in a single DataFrame



if False:   
    df = pd.read_pickle("names.dat") # load it from pickle format

else:
    import os # Python module which implements the listdir() function
    df = pd.DataFrame() # global DataFrame in which all data will be put
    path = 'names' # folder with files to be processed

    for filename in os.listdir(path): # loop on all files in the folder
        if filename[-3:] != 'txt': # check whether the file is to be processed or not #mesela folderin icinde alakasiz bi
            #pdf dosyasÄ± var, onu cÄ±karmak Ä±cÄ±n son 3 harfi txt olmayan seyleri cÄ±kar yapÄ±yosun
            continue
        year = int(filename[3:7]) # extract year from file name
        csv = pd.read_csv(os.path.join(path, filename), names=['name', 'gender', 'births']) # load the file as a new DataFrame
        csv['year'] = year # add a column with the year to the new DataFrame
        df = df.append(csv, ignore_index=True) # append the new DataFrame to the global one

    df = df[['year', 'name', 'gender', 'births']] # reorder columns of the global DataFrame
    df.to_pickle("names.dat") # save it to pickle format

<div class="alert alert-info">
<b>Tip</b>
<ul>
    <li>The `pickle` module of `Python` implements binary protocols for serializing and de-serializing a Python object structure, see: https://docs.python.org/3.6/library/pickle.html.</li>
    <li>The `pandas` module implements `to_pickle()` and `read_pickle()` for `Series`and `DataFrame` objects</li>
    <li>When the import and transformation of a large dataset is time consuming, it is convenient to serialize the `DataFrame` so as to reload it quickly.</li>
    <li>`WARNING`: The serialization of such objects is mostly dependent of the version of `pandas`, and objects serialized using a version might not be loadable again from another version.</li>
</ul>
</div>

In [20]:
# the whole data
df

         year       name gender  births
0        1880       Mary      F    7065
1        1880       Anna      F    2604
2        1880       Emma      F    2003
3        1880  Elizabeth      F    1939
4        1880     Minnie      F    1746
5        1880   Margaret      F    1578
6        1880        Ida      F    1472
7        1880      Alice      F    1414
...       ...        ...    ...     ...
1924657  2017       Zyel      M       5
1924658  2017     Zyheem      M       5
1924659  2017     Zyhier      M       5
1924660  2017      Zykai      M       5
1924661  2017     Zykeem      M       5
1924662  2017      Zylin      M       5
1924663  2017      Zylis      M       5
1924664  2017      Zyrie      M       5

[1924665 rows x 4 columns]

The result is a large `DataFrame` with 1.924.665 rows and 4 columns. One can access to each column individually which is called a `Series`.

# 2. Pandas data structures: Series and DataFrame

The `panda` name comes from `PAN`(el) + `DA`(taframe) + `S`(eries) where panels, dataframes and series are the 3-D, 2-D and 1-D objects. Panels have been removed from the library and are now replaced by multi-index dataframes.

## 2.1 Series, 1-D objects

One can access to each column of a `DataFrame` using the square bracket operator `[]` and the label of the column.

The obtained object is an instance of Series. it is a 1 dimensionnal structure along with an index.

This `Pandas` class relies on the `Numpy.ndarray` structure. All methods available for `ndarray` are more or less available for `Series`.

The `Series` object holds an index that is identical to the one of the `DataFrame`. It has a name that is the label of the column of the `DataFrame` object. In fact, it is a view of the `DataFrame`: all modificatons on the `Series` object will be reported on the `DataFrame` object.

### 2.1.1 Common Series attributes

attribute|result
-|-
s.name|name of s
s.values|values of s
s.index|index of s
s.shape|dimension of s
s.size|number of elements of s
s.dtype|type of elements of s
s.empty|True if s is empty, False otherwise

In [26]:
# Series from the 'name' column
s = df["name"]
s

0               Mary
1               Anna
2               Emma
3          Elizabeth
4             Minnie
5           Margaret
6                Ida
7              Alice
             ...
1924657         Zyel
1924658       Zyheem
1924659       Zyhier
1924660        Zykai
1924661       Zykeem
1924662        Zylin
1924663        Zylis
1924664        Zyrie
Name: name, Length: 1924665, dtype: object

In [23]:
# type of object s
type(s)

pandas.core.series.Series

In [24]:
# 'name' attribute of s is the label of the column
s.name

'name'

In [20]:
# 'values' attribute of s
# it is a 1-D numpy ndarray
s.values

array(['Mary', 'Anna', 'Emma', ..., 'Zylin', 'Zylis', 'Zyrie'],
      dtype=object)

In [21]:
type(s.values)

numpy.ndarray

In [22]:
# 'index' attribute of s
# cf. range type of Python
s.index

RangeIndex(start=0, stop=1924665, step=1)

In [23]:
# 'shape' attribute of s
s.shape

(1924665,)

In [24]:
# 'size' attribute of s
s.size

1924665

In [25]:
# 'dtype' attribute of s
s.dtype

dtype('O')

### 2.1.2 Common Series methods

`Series` objects have several common methods:

method|result
-|-
s.head()|first elements of s
s.tail()|last elements of s
s.nunique()|number of unique elements of s
s.value_counts()|number of occurrences of unique elements of s
s.unique()|ndarray with unique elements of s

The `Series` class defines 325 attributes or methods in the `pandas` module.

In [13]:
# first elements, by default 5
s.head()

NameError: name 's' is not defined

In [30]:
s.head(100)

0          Mary
1          Anna
2          Emma
3     Elizabeth
4        Minnie
5      Margaret
6           Ida
7         Alice
        ...
92         Ruth
93        Viola
94        Olive
95       Amelia
96       Hannah
97         Jane
98     Virginia
99        Emily
Name: name, Length: 100, dtype: object

In [27]:
# last elements, by default 5
s.tail(3)

1924662    Zylin
1924663    Zylis
1924664    Zyrie
Name: name, dtype: object

In [31]:
# number of unique values
s.nunique()

97310

In [32]:
# number of unique values
df['gender'].nunique()

2

In [33]:
# number of unique values
df['year'].nunique()

138

In [34]:
# value counts
df['births'].value_counts()

5        268536
6        191470
7        144621
8        114284
9         92284
10        76927
11        64677
12        55832
          ...
5590          1
7639          1
10704         1
52116         1
13779         1
33222         1
7054          1
10736         1
Name: births, Length: 13691, dtype: int64

**Observation**

The object returned by the `value_counts()` method is also a `Series` object. In `pandas`, many operations on a `Series` or  a `DataFrame` object return another `Series` or `DataFrame` object.

The `Series` object is organized so that the values are sorted in the reverse order.

In [35]:
# value counts
s2 = df['births'].value_counts()
type(s2)

pandas.core.series.Series

In [36]:
# 'index' attribute of s2 #birthden gelen index
s2.index

Int64Index([    5,     6,     7,     8,     9,    10,    11,    12,    13,
               14,
            ...
            15827, 56214,  5590,  7639, 10704, 52116, 13779, 33222,  7054,
            10736],
           dtype='int64', length=13691)

In [37]:
s2.index[0]

5

In [ ]:
# to get the most frequent value
s2.index[0]

In [ ]:
# 'values' attribute of s2
s2.values

In [ ]:
# to get the count of the most frequent value
s2.values[0]

<div class="alert alert-success">
**Exercise 1**
<ul>
<li>What is the value counts of genders. How can we interpret the result?</li>
<li>What are the top 16 value counts of names. How can we interpret the result?</li>
<li>What are the 10 years for which we have the most distinct names + gender? What is the finding?</li>
</ul>
</div>

In [27]:
df['gender'].value_counts()

F    1138293
M     786372
Name: gender, dtype: int64

In [42]:
df['name'].value_counts()

Jesse        276
Leslie       276
Jean         276
James        276
John         276
William      276
Jessie       276
Francis      276
            ...
Arlane         1
Chariese       1
Taniayah       1
Phawn          1
Saral          1
Rosisela       1
Ashleyrae      1
Mancie         1
Name: name, Length: 97310, dtype: int64

In [43]:
df['name'].value_counts().head(16)

Jesse      276
Leslie     276
Jean       276
James      276
John       276
William    276
Jessie     276
Francis    276
Tommie     276
Marion     276
Lee        276
Johnnie    276
Joseph     276
Ollie      276
Sidney     276
Charlie    275
Name: name, dtype: int64

In [ ]:
# %load session2/ex_01.py

In [ ]:
df['year'].value_counts().head(10)

### 2.1.3 Vectorial operations with Series

All vectorial operations for `numpy.ndarray` are available for `Series` objects:

- logical:
    - between 2 `Series` objects: `&` (AND), `|` (OR), `~` (NOT)
    - within values of a single `Series` object: `any()` (OR), `all()` (AND)
- usual mathematical functions: e.g.,  `abs()`, `sqrt()`, `sign()`, `floor()`, `rint()`
- advanced mathematical functions: e.g., trigonometric, logarithm, exponential
- vectorial computation with a scalar value, a list of values with the `isin()` method, or another `Series` object
- comparison with a scalar value or another `Series` object
- usual statistical functions: e.g., `sum()`, `min()`, `max()`, `mean()`, `median()`, `std()`, `var()`, `cumsum()`, `cumprod()`, `cummin()`, `cummax()`, `idxmin()`, `idxmax()`

In [28]:
# series of births
s = df["births"]
s

0          7065
1          2604
2          2003
3          1939
4          1746
5          1578
6          1472
7          1414
           ...
1924657       5
1924658       5
1924659       5
1924660       5
1924661       5
1924662       5
1924663       5
1924664       5
Name: births, Length: 1924665, dtype: int64

In [29]:
# sum of s
s.sum()

348120517

In [30]:
# min of s
s.min()

5

In [31]:
# max of s
s.max()

99686

In [32]:
# s times 3
s * 3

0          21195
1           7812
2           6009
3           5817
4           5238
5           4734
6           4416
7           4242
           ...
1924657       15
1924658       15
1924659       15
1924660       15
1924661       15
1924662       15
1924663       15
1924664       15
Name: births, Length: 1924665, dtype: int64

In [33]:
# s equals 5
s == 5

0          False
1          False
2          False
3          False
4          False
5          False
6          False
7          False
           ...
1924657     True
1924658     True
1924659     True
1924660     True
1924661     True
1924662     True
1924663     True
1924664     True
Name: births, Length: 1924665, dtype: bool

In [34]:
# s is in [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]?
s.isin(list(range(10)))

0          False
1          False
2          False
3          False
4          False
5          False
6          False
7          False
           ...
1924657     True
1924658     True
1924659     True
1924660     True
1924661     True
1924662     True
1924663     True
1924664     True
Name: births, Length: 1924665, dtype: bool

In [35]:
# are they rows in which number of births equal year?
(s == df["year"]).any()

True

In [36]:
# cumsum of s
s.cumsum()

0               7065
1               9669
2              11672
3              13611
4              15357
5              16935
6              18407
7              19821
             ...
1924657    348120482
1924658    348120487
1924659    348120492
1924660    348120497
1924661    348120502
1924662    348120507
1924663    348120512
1924664    348120517
Name: births, Length: 1924665, dtype: int64

In [37]:
# cumprod of s
# warning to the limited integer representation in the underlying numpy, coded on 64 bits
s.cumprod()

0                         7065
1                     18397260
2                  36849711780
3               71451591141420
4           124754478132919320
5         -6051618317058380816
6          1795224891776869376
7         -7202685199424825344
                  ...
1924657                      0
1924658                      0
1924659                      0
1924660                      0
1924661                      0
1924662                      0
1924663                      0
1924664                      0
Name: births, Length: 1924665, dtype: int64

<div class="alert alert-warning">
<b>Further reading</b>
<ul>
    <li>Floating Point Arithmetic: Issues and Limitations.</li>
    <li>To better understand the limit of floating point representation, see: https://docs.python.org/3.6/tutorial/floatingpoint.html</li>
</ul>
</div>

### 2.1.4 Operations on Series objects containing strings

The `str` operator enables to deal with `Series` objects holding strings in order to get a new `Series` object.

Thanks to the `str` operator, most of Python functions dedicated to strings are available for `Series` object holding strings: `len()`, `startswith()`, `contains()`, `endswith()`, `split()`, `lower()`, `upper()`, `capitalize()`, `title()`, ...

These methods return a new `Series` object containing the result of the function applied to each element.

In [ ]:
# length of 5 first names
df["name"].str.len().head()

**Observation**: starting with head() would have been more efficient, since the length is only computed on the 5 first names.

In [40]:
# length of 5 first names
df["name"].head().str.len()

0    4
1    4
2    4
3    9
4    6
Name: name, dtype: int64

<div class="alert alert-info">
<b>Jupyter hint</b>:
We can check it with the magic command <pre>%timeit</pre> which enables to compute the efficiency of a statement.
</div>

In [41]:
%timeit df["name"].str.len().head()

821 ms Â± 55.1 ms per loop (mean Â± std. dev. of 7 runs, 1 loop each)

In [42]:
%timeit df["name"].head().str.len()

330 Âµs Â± 35.5 Âµs per loop (mean Â± std. dev. of 7 runs, 1000 loops each)

<div class="alert alert-success">
**Exercise 2**
<ul>
<li>Compute the minimum and the maximum length of names</li>
<li>Give the value counts of names length</li>
</ul>
</div>

In [ ]:
# %load session2/ex_02.py

In [44]:
df["name"].str.len().min()

2

In [45]:
df["name"].str.len().max()

15

In [46]:
df["name"].str.len().value_counts()

6     546519
7     424360
5     404291
8     213803
4     177838
9      78946
3      41274
10     23437
11      6461
2       4660
12      1610
13       946
14       390
15       130
Name: name, dtype: int64

## 2.2 DataFrame, 2-D objects

A `DataFrame` object is a table of data as we encounter frequently in many information systems: R data.frame, CSV or TSV file, Excel sheet, table of a data base...

Generally, a table is compound of a number of homogeneous records or rows. Each line represents a specific record and the columns stand for the features of each records.

The objects that may be included in a `DataFrame` might be of any kind:
- booleans: `bool`
- integers: `int64`
- floating number: `float64`
- date objects: `datetime`, `timestamp`
- strings and any objects: `object` (the more general object)


*Nota bene*

- `pandas` tries to use the most adapted type according to the data in each column
- If the type of a column is `object`, it may contains other objects than strings.

### 2.2.1 Common DataFrame attributes

attribute|result
-|-
df.shape|dimensions of df
df.size|number of elements of df
df.values|values of df
df.index|index of df
df.index.is_unique|if index of df is unique
df.columns|columns of df
df.dtypes|types of columns of df
df.empty|True if df is empty, False otherwise

In [47]:
# type of object df
type(df)

pandas.core.frame.DataFrame

In [48]:
# dimensions of df
df.shape

(1924665, 4)

In [49]:
# number of rows of df
len(df)

1924665

In [50]:
# total number of elements of df
df.size

7698660

In [51]:
# values of df
# it is a 2-D numpy ndarray
df.values

array([[1880, 'Mary', 'F', 7065],
       [1880, 'Anna', 'F', 2604],
       [1880, 'Emma', 'F', 2003],
       ...,
       [2017, 'Zylin', 'M', 5],
       [2017, 'Zylis', 'M', 5],
       [2017, 'Zyrie', 'M', 5]], dtype=object)

In [52]:
# first line of values of df
# numpy accessor
df.values[0]

array([1880, 'Mary', 'F', 7065], dtype=object)

In [53]:
# first column of values of df
# numpy accessor
df.values[:, 0]

array([1880, 1880, 1880, ..., 2017, 2017, 2017], dtype=object)

In [54]:
# index of df
df.index

RangeIndex(start=0, stop=1924665, step=1)

In [55]:
# index of df is unique
df.index.is_unique

True

In [56]:
# columns of df
df.columns

Index(['year', 'name', 'gender', 'births'], dtype='object')

In [ ]:
# dtypes of columns of df
df.dtypes

### 2.2.2 Common DataFrame methods

`DataFrame` objects have several common methods:

method|result
-|-
df.head()|first rows of df
df.tail()|last rows of df
df.info()|information on df
df.count()|number of non NA elements in each column
df.transpose or df.T()|transposition of df

The `DataFrame` class defines 224 attributes or methods in the `pandas` module.

In [57]:
# first rows, by default 5
df.head(7)

   year       name gender  births
0  1880       Mary      F    7065
1  1880       Anna      F    2604
2  1880       Emma      F    2003
3  1880  Elizabeth      F    1939
4  1880     Minnie      F    1746
5  1880   Margaret      F    1578
6  1880        Ida      F    1472

In [58]:
# last rows, by default 5
df.tail()

         year    name gender  births
1924660  2017   Zykai      M       5
1924661  2017  Zykeem      M       5
1924662  2017   Zylin      M       5
1924663  2017   Zylis      M       5
1924664  2017   Zyrie      M       5

In [59]:
# information on df
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1924665 entries, 0 to 1924664
Data columns (total 4 columns):
year      int64
name      object
gender    object
births    int64
dtypes: int64(2), object(2)
memory usage: 58.7+ MB

In [60]:
# transposition of df
df_t = df.T # or df.transpose()
df_t

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,...,1924650,1924651,1924652,1924653,1924654,1924655,1924656,1924657,1924658,1924659,1924660,1924661,1924662,1924663,1924664
year,1880,1880,1880,1880,1880,1880,1880,1880,1880,1880,1880,1880,1880,1880,1880,...,2017,2017,2017,2017,2017,2017,2017,2017,2017,2017,2017,2017,2017,2017,2017
name,Mary,Anna,Emma,Elizabeth,Minnie,Margaret,Ida,Alice,Bertha,Sarah,Annie,Clara,Ella,Florence,Cora,...,Ziyang,Zkari,Zohaan,Zoren,Zorion,Zubeyr,Zy,Zyel,Zyheem,Zyhier,Zykai,Zykeem,Zylin,Zylis,Zyrie
gender,F,F,F,F,F,F,F,F,F,F,F,F,F,F,F,...,M,M,M,M,M,M,M,M,M,M,M,M,M,M,M
births,7065,2604,2003,1939,1746,1578,1472,1414,1320,1288,1258,1226,1156,1063,1045,...,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5

In [61]:
# index of a transposed df is its columns
df_t.index

Index(['year', 'name', 'gender', 'births'], dtype='object')

In [62]:
# columns of a transposed df are its index
df_t.columns

RangeIndex(start=0, stop=1924665, step=1)

In [63]:
# first line in a column
df.head(1).T

           0
year    1880
name    Mary
gender     F
births  7065

<div class="alert alert-success">
**Exercise 3**
<ul>
    <li>Perform few operations on df2017:</li>
    <ul>
        <li>dimensions</li>
        <li>first and last rows</li>
        <li>transposition</li>
        <li>information</li>
    </ul>
</ul>
</div>

In [ ]:
# %load session2/ex_03.py

*Nota bene*

When the label of a column does not contains space, or other special characters, and does not overlap with a `DataFrame` object attribute or method, it is possible to use it as an attribute to get the column.

For instance: `df.gender`

As it does not work systematically, we do not recommend using this notation. It is explained here, since it can be used in code found on the internet.

In [64]:
# column name as an attribute
df.gender

0          F
1          F
2          F
3          F
4          F
5          F
6          F
7          F
          ..
1924657    M
1924658    M
1924659    M
1924660    M
1924661    M
1924662    M
1924663    M
1924664    M
Name: gender, Length: 1924665, dtype: object

It is possible to modify the index of a `DataFrame` object by using the `set_index()` method with a column of the `DataFrame` object.

In [65]:
# year 2017
df2017

            name gender  births
0           Emma      F   19738
1         Olivia      F   18632
2            Ava      F   15902
3       Isabella      F   15100
4         Sophia      F   14831
5            Mia      F   13437
6      Charlotte      F   12893
7         Amelia      F   11800
...          ...    ...     ...
32461       Zyel      M       5
32462     Zyheem      M       5
32463     Zyhier      M       5
32464      Zykai      M       5
32465     Zykeem      M       5
32466      Zylin      M       5
32467      Zylis      M       5
32468      Zyrie      M       5

[32469 rows x 3 columns]

In [66]:
# the name column is used as an index
name2017 = df2017.set_index("name")
name2017

          gender  births
name
Emma           F   19738
Olivia         F   18632
Ava            F   15902
Isabella       F   15100
Sophia         F   14831
Mia            F   13437
Charlotte      F   12893
Amelia         F   11800
...          ...     ...
Zyel           M       5
Zyheem         M       5
Zyhier         M       5
Zykai          M       5
Zykeem         M       5
Zylin          M       5
Zylis          M       5
Zyrie          M       5

[32469 rows x 2 columns]

In [67]:
# accessing to a column
name2017["births"]

name
Emma         19738
Olivia       18632
Ava          15902
Isabella     15100
Sophia       14831
Mia          13437
Charlotte    12893
Amelia       11800
             ...
Zyel             5
Zyheem           5
Zyhier           5
Zykai            5
Zykeem           5
Zylin            5
Zylis            5
Zyrie            5
Name: births, Length: 32469, dtype: int64

In [68]:
# index of min
name2017["births"].idxmin()

'Aadilynn'

In [71]:
# index of max
name2017["births"].idxmax()

'Emma'

In [72]:
# index of the new DataFrame object
name2017.index

Index(['Emma', 'Olivia', 'Ava', 'Isabella', 'Sophia', 'Mia', 'Charlotte',
       'Amelia', 'Evelyn', 'Abigail',
       ...
       'Zubeyr', 'Zy', 'Zyel', 'Zyheem', 'Zyhier', 'Zykai', 'Zykeem', 'Zylin',
       'Zylis', 'Zyrie'],
      dtype='object', name='name', length=32469)

In [73]:
# name of the index of the new DataFrame object
name2017.index.name

'name'

In [69]:
# the index of the new DataFrame object is not unique
name2017.index.is_unique #why its false not unique, male and female names there are both names f and m mesela Clem hem erkek hem kadÄ±n ismi

False

<div class="alert alert-success">
**Exercise 4**
<ul>
    <li>Why is the index not unique?</li>
    <li>Limit the name2017 DataFrame object to the first 18309 rows and check that the index is unique.</li>
</ul>
</div>

In [74]:
name2017 = name2017.head(18309)
name2017.index.is_unique

True

In [ ]:
# %load session2/ex_04.py

### 2.2.3 Vectorial operations with DataFrame

Usual statistical functions available for `Series` objects are also available for `DataFrame` objects: e.g., `sum()`, `min()`, `max()`, `mean()`, `median()`, `std()`, `var()`, `cumsum()`, `cumprod()`, `cummin()`, `cummax()`, `idxmin()`, `idxmax()`.

- `f(axis=0)` invokes a function `f` to each <b>column</b> of a `DataFrame` object and returns a <b>row-like</b> result.
- `f(axis=1)` invokes a function `f` to each <b>row</b> of a `DataFrame` object and returns a <b>column-like</b> result.

In [75]:
# max of columns
name2017.max()

gender        F
births    19738
dtype: object

In [76]:
# max of rows
df2017.head()#min(axis=1)

       name gender  births
0      Emma      F   19738
1    Olivia      F   18632
2       Ava      F   15902
3  Isabella      F   15100
4    Sophia      F   14831

# 3. Accessing to data

Observation about the vocabulary:
- Objects of type `Series` and `DataFrame` have index which might be integer (by default) or more generally labels such as strings. When the index is unique, these objects behave like a dictionary which is accessed with a key.
- These objects are also based on `numpy.ndarray` vectors or tables which can be accessed by position, i.e. by an integer (starting at 0). Therefore these objects may also behave like an ordered sequence of 1 or 2 dimensions which is accessed with a position.

The notation used for ordered sequences in `Python`, and `ndarray` in `numpy`, has been re-used for index of `Series` and `DataFrame`,with a slightly difference:
- When 2 labels are indicated, the second label is included in the selection, contrary to standard `Python` and `numpy` slicing.
- When 2 labels are indicated, the notation works only if the index is unique.

## 3.1 Accessing to data from Series

Several operators enable to access to data from Series.
- `[]`: selection with a label or a position (if the index is not made of integers)
    - `s[i]`: selection of a single label or position
    - `s[[i, j, k]]`: selection of several labels or positions (also called fancy indexing)
    - `s[i:j]`, `s[i:j:k]`: selection of a slice (`j` is included when it is a label and excluded when it is a position)
    - `s[mask]`: selection from a boolean mask sharing the very same index than the `Series` object, `True` = selection, `False` = non selection
- `.loc[]`: idem but reserved to labels
- `.iloc[]`: idem but reserved to positions

When the selection corresponds to a single value, it returns a scalar value.

When the selection corresponds to several values, it returns a `Series` object.

In [77]:
# selection of a column
s = name2017["births"]
s

name
Emma         19738
Olivia       18632
Ava          15902
Isabella     15100
Sophia       14831
Mia          13437
Charlotte    12893
Amelia       11800
             ...
Zulmy            5
Zyannah          5
Zyiana           5
Zyianna          5
Zykira           5
Zymia            5
Zynia            5
Zyonn            5
Name: births, Length: 18309, dtype: int64

### 3.1.1 Selection in Series by label or position

In [79]:
# selection by label
s.loc["Emma"] # or s["Emma"]

19738

In [80]:
# selection by position
s.iloc[0] # or s[0]

19738

In [81]:
# selection by a list of labels
s.loc[["Emma", "Sophia", "Mia"]]  # or s[["Emma", "Sophia", "Mia"]]

name
Emma      19738
Sophia    14831
Mia       13437
Name: births, dtype: int64

In [82]:
# selection by a list of positions
s.iloc[[0, 2, 5]]  # or s[[0, 2, 5]]

name
Emma    19738
Ava     15902
Mia     13437
Name: births, dtype: int64

In [78]:
# selection by a slice of index
# Warning label "Mia" is included
s.loc["Emma":"Mia"]  # or s["Emma":"Mia"]

name
Emma        19738
Olivia      18632
Ava         15902
Isabella    15100
Sophia      14831
Mia         13437
Name: births, dtype: int64

In [83]:
# selection by a slice of index
# Warning label "Mia" is included
s.loc["Emma":"Mia":2]  # or s["Emma":"Mia":2]

name
Emma      19738
Ava       15902
Sophia    14831
Name: births, dtype: int64

In [84]:
# selection by a slice of positions
# Warning position 6 is excluded
s.iloc[0:6]  # or s[0:6]

name
Emma        19738
Olivia      18632
Ava         15902
Isabella    15100
Sophia      14831
Mia         13437
Name: births, dtype: int64

In [85]:
# selection by a slice of positions
# Warning position 6 is excluded
s.iloc[0:6:2]  # or s[0:6:2]

name
Emma      19738
Ava       15902
Sophia    14831
Name: births, dtype: int64

### 3.1.2 Selection in Series with a boolean mask

It is possible to perform a selection in `Series` object with a boolean mask, i.e. a boolean Series objects sharing the same index than the initial `Series`.

The easiest way is to build a boolean `Series` object from the `Series` object itself.

It is possible to combine boolean masks using logicial operations between boolean objects of type `Series`:

- AND is `&`
- OR is `|`
- NOT is `~`

In [86]:
# all names
s = df["name"]
s

0               Mary
1               Anna
2               Emma
3          Elizabeth
4             Minnie
5           Margaret
6                Ida
7              Alice
             ...
1924657         Zyel
1924658       Zyheem
1924659       Zyhier
1924660        Zykai
1924661       Zykeem
1924662        Zylin
1924663        Zylis
1924664        Zyrie
Name: name, Length: 1924665, dtype: object

In [87]:
# boolean vector according if the name starts with an "A"
mask = s.str.startswith("A")  #burdaki s en basta yazan ustte tanÄ±mladÄ±gÄ±m s 
mask

0          False
1           True
2          False
3          False
4          False
5          False
6          False
7           True
           ...
1924657    False
1924658    False
1924659    False
1924660    False
1924661    False
1924662    False
1924663    False
1924664    False
Name: name, Length: 1924665, dtype: bool

In [88]:
# selection from a boolean mask
s2 = s.loc[mask]  # or s[mask]
s2

1             Anna
7            Alice
10           Annie
32             Ada
53           Agnes
81            Alma
82           Addie
88          Amanda
            ...
1922906     Ayston
1922907      Ayvan
1922908      Azani
1922909    Azavier
1922910       Azen
1922911    Azeriah
1922912      Azier
1922913       Azra
Name: name, Length: 187950, dtype: object

In [89]:
# names starting with "Nath"
s.loc[s.str.startswith("Nath")]

1056          Nathan
1146       Nathaniel
1961       Nathanial
2724        Nathalie
3073          Nathan
3158       Nathaniel
5086          Nathan
5181       Nathaniel
             ...
1912905    Nathanial
1913039       Nathen
1917867     Nathanel
1918408       Nathyn
1919074       Nathon
1920883    Nathaneal
1924065    Nathanyel
1924066      Nathias
Name: name, Length: 1736, dtype: object

<div class="alert alert-success">
**Exercise 5**
<ul>
<li>Which names start with a "Z"?</li>
<li>Which names end with a "z"?</li>
<li>Which names start with a "Z" and end with a "z"?</li>
</ul>
</div>

In [90]:
s.loc[s.str.startswith("Z")]

280         Zella
303          Zora
307          Zula
340           Zoe
386         Zelma
490          Zada
675         Zetta
676           Zoa
            ...
1924657      Zyel
1924658    Zyheem
1924659    Zyhier
1924660     Zykai
1924661    Zykeem
1924662     Zylin
1924663     Zylis
1924664     Zyrie
Name: name, Length: 23452, dtype: object

In [ ]:
# %load session2/ex_05.py

In [94]:
s.loc[s.str.endswith("z")]  #buyuk Z degil kucuk z olmasÄ± lazÄ±m son harf oldugu icin

140           Inez
1349         Fritz
1778          Cruz
1929         Jabez
2149          Inez
3606         Fritz
4090          Inez
5356         Fritz
            ...
1924347    Shawaiz
1924398     Stilez
1924441      Tarez
1924448       Tazz
1924468     Thomaz
1924514      Tyrez
1924578      Yagiz
1924588      Yavuz
Name: name, Length: 7171, dtype: object

In [95]:
s.loc[s.str.startswith("Z") & s.str.endswith("z") ]

1332737    Zyquez
1551207    Zyquez
1583538    Zyquez
1616296    Zyquez
1721126    Zyquez
1826111    Zoraiz
1853909    Zoraiz
1888736    Zoraiz
1921199    Zoraiz
Name: name, dtype: object

In [97]:
# names that contain 2 "z" separated by at least one character
s.loc[s.str.contains("z.z")].unique()   #zler ortasÄ±na . koyarsan z arada herhangi bi harf ve z olan names leri goster

array(['Aziz', 'Aziza', 'Azizi', 'Azizah', 'Abdulaziz', 'Abdelaziz',
       'Abdiaziz', 'Aranzazu', 'Azuzena', 'Azazel', 'Abdoulaziz', 'Zzyzx',
       'Azizjon', 'Ezoza'], dtype=object)

In [98]:
s.loc[s.str.contains("zz")].unique()

array(['Lizzie', 'Kizzie', 'Dezzie', 'Nezzie', 'Ozzie', 'Azzie', 'Mazzie',
       'Izzie', 'Lizzy', 'Elizzie', 'Hezzie', 'Ezzie', 'Nazzareno',
       'Izzy', 'Lizzette', 'Hazzie', 'Lazzaro', 'Rozzie', 'Buzzy', 'Buzz',
       'Dizzy', 'Yazzie', 'Suzzanne', 'Suzzette', 'Suzzane', 'Ezzard',
       'Suzzanna', 'Suzzie', 'Lizz', 'Melizza', 'Cazzie', 'Lizza',
       'Shabazz', 'Lizzett', 'Lizzet', 'Kizzy', 'Kizzi', 'Kizzey',
       'Lakizzy', 'Kezzy', 'Brezzy', 'Kezzie', 'Lizzeth', 'Rizza',
       'Jazzmine', 'Kizze', 'Chazz', 'Jazzmin', 'Ozzy', 'Jazzmen',
       'Jazzlyn', 'Jazz', 'Jazzma', 'Jazzman', 'Vanezza', 'Jazzlynn',
       'Yizza', 'Lizzete', 'Jazzmon', 'Calizza', 'Lizzieann', 'Jazzmyn',
       'Uzziel', 'Jazzy', 'Jazzmyne', 'Jazzalyn', 'Jazzi', 'Jazzie',
       'Alyzza', 'Jazzlin', 'Gizzel', 'Jazzmene', 'Marizza', 'Tazz',
       'Yazzmine', 'Azzam', 'Kazz', 'Kazzandra', 'Jazzae', 'Uzziah',
       'Jazzia', 'Fizza', 'Jazzmaine', 'Julizza', 'Mazzy', 'Jazzmun',
       'Jazzmond', 'Izzat', 'Yulizza', 'Azza', 'Jazzminn', 'Izzabella',
       'Dazza', 'Elizza', 'Jazzarae', 'Izzac', 'Muzzammil', 'Alizza',
       'Jazzlyne', 'Fabrizzio', 'Azzan', 'Izzak', 'Litzzy', 'Gizzelle',
       'Brizza', 'Jazzelle', 'Izza', 'Azzure', 'Izzabelle', 'Larizza',
       'Jazziel', 'Izziah', 'Aizza', 'Yazzmin', 'Lizzbeth', 'Dazzlyn',
       'Mazzi', 'Hazzel', 'Azzaria', 'Izzabell', 'Ozziel', 'Azzareya',
       'Jazzalynn', 'Lizzi', 'Azziah', 'Izzah', 'Jazzell', 'Condoleezza',
       'Jazzel', 'Jazzlynne', 'Jezzel', 'Jizzel', 'Izzi', 'Jazzlene',
       'Jizzelle', 'Jazzelyn', 'Izzaiah', 'Alizzon', 'Allizzon',
       'Izzabela', 'Jazziah', 'Brizzia', 'Izzibella', 'Jazzanae',
       'Jezzelle', 'Yaritzza', 'Jazzleen', 'Izzabel', 'Izzabellah',
       'Jozzlynn', 'Dezzarae', 'Ezzah', 'Jazzilyn', 'Jazzabella',
       'Jazzariah', 'Jazzmarie', 'Muizz', 'Enzzo', 'Izzik', 'Mezziah',
       'Jazzilynn', 'Elizzabeth', 'Jazzabelle', 'Izzybella', 'Rozzlyn',
       'Yazziel', 'Elyzza', 'Jazzmynn', 'Azzahra', 'Daleyzza', 'Grizzly',
       'Rizzo', 'Drizzt', 'Izzack', 'Uzziyah', 'Ozzi'], dtype=object)

<div class="alert alert-info">
<b>Tip</b><br />
**Regular expressions**, or **regex**, enable to capture paterns in strings. In this kind of expressions, some characters have a special meaning to perform matching:
<ul>
    <li>`.`: matches any character</li>
    <li>`^`: matches the start of the string</li>
    <li>`$`: matches the end of the string</li>
    <li>`*`: matches 0 or more repetitions of the preceding expression</li>
    <li>`+`: matches 1 or more repetitions of the preceding expression</li>
    <li>`?`: matches 0 or 1 repetition of the preceding expression</li>
    <li>Prefix any of those special characters with a backslash `\` so that they are considered as standard characters</li>
</ul>
The string method  `contains()` tackles by default with regular expressions. Use the `regex=False` option to search for literals.
</div>

In [99]:
s.loc[s.str.contains("z.+z")].unique() #z ve arada herhangi harfler olsun z'ler arasÄ±nda

array(['Kazimierz', 'Krzysztof', 'Aziz', 'Aziza', 'Azizi', 'Azizah',
       'Abdulaziz', 'Grzegorz', 'Nixzaliz', 'Azeez', 'Abdelaziz',
       'Abdulazeez', 'Abdiaziz', 'Aranzazu', 'Azuzena', 'Ezperanza',
       'Azazel', 'Abdoulaziz', 'Zzyzx', 'Azeeza', 'Azizjon', 'Ezoza'],
      dtype=object)

<div class="alert alert-warning">
<b>Further reading</b>
<ul>
    <li>Regular expressions are useful when dealing with textual information.</li>
    <li>For more information on regular expressions in Python, see: https://docs.python.org/3.6/library/re.html</li>
</ul>
</div>

## 3.2 Accessing to data from DataFrame

Same operators enable to access to data from `DataFrame`.
- `[]`: selection of a column with a label or a position (if the column names are not made of integers)
    - `df[i]`: selection of a single column by label or position
    - `df[[i, j, k]]`: selection of several columns by labels or positions (fancy indexing)
    - `df[i:j]`, `df[i:j:k]`: selection of a slice (`j` is included when it is a label and excluded when it is a position)
    - `df[mask]`: selection from a boolean mask sharing the very same index than the `DataFrame` object, `True` = selection, `False` = non selection
- `.loc[x, y]`: idem but reserved to labels, when y is not defined all columns are returned
- `.iloc[x, y]`: idem but reserved to positions, when y is not defined all columns are returned

When the selection corresponds to a single value, it returns a scalar value.

When the selection corresponds to a part of column or of a row, it returns a `Series` object. When it is a subpart of a column, its index is a subpart of the index of the initial `DataFrame`. When it is a subpart of a row, its index is a subpart of the columns of the initial `DataFrame`.

When the selection corresponds to several rows and several columns, it returns a `DataFrame` object, which index is is a subpart of the index of the initial `DataFrame` and the columns a subpart of the columns of the initial `DataFrame`.

### 3.2.1 Selecting columns in DataFrame

When selecting a single column, we obtain a `Series` object which shares the same index than the `DataFrame`.

When selecting several columns, we obtain a new `DataFrame`: subset of the original one and sharing the same index with as many rows.

This last technique enables also to reorder the columns of a `DataFrame`.

In [101]:
# selection of columns by labels
df[["name", "gender"]]

              name gender
0             Mary      F
1             Anna      F
2             Emma      F
3        Elizabeth      F
4           Minnie      F
5         Margaret      F
6              Ida      F
7            Alice      F
...            ...    ...
1924657       Zyel      M
1924658     Zyheem      M
1924659     Zyhier      M
1924660      Zykai      M
1924661     Zykeem      M
1924662      Zylin      M
1924663      Zylis      M
1924664      Zyrie      M

[1924665 rows x 2 columns]

**With the `.loc[]` operator**
- the first argument selects rows; to select all rows one can put a column `:`
- the second argument selects columns (optionnal)

In [102]:
# selection of columns by labels using .loc
# the : alone stands for all rows from start to end
df.loc[:, ["name", "gender"]]

              name gender
0             Mary      F
1             Anna      F
2             Emma      F
3        Elizabeth      F
4           Minnie      F
5         Margaret      F
6              Ida      F
7            Alice      F
...            ...    ...
1924657       Zyel      M
1924658     Zyheem      M
1924659     Zyhier      M
1924660      Zykai      M
1924661     Zykeem      M
1924662      Zylin      M
1924663      Zylis      M
1924664      Zyrie      M

[1924665 rows x 2 columns]

**With the `.iloc[]` operator**
- the first argument selects rows; to select all rows one can put a column `:`
- the second argument selects columns (optionnal)

In [103]:
# selection of columns by slice of positions using .iloc
# the : alone stands for all rows from start to end
df.iloc[:, 1:3]

              name gender
0             Mary      F
1             Anna      F
2             Emma      F
3        Elizabeth      F
4           Minnie      F
5         Margaret      F
6              Ida      F
7            Alice      F
...            ...    ...
1924657       Zyel      M
1924658     Zyheem      M
1924659     Zyhier      M
1924660      Zykai      M
1924661     Zykeem      M
1924662      Zylin      M
1924663      Zylis      M
1924664      Zyrie      M

[1924665 rows x 2 columns]

### 3.2.2 Selecting rows in DataFrame

When selecting a single row, we obtain a `Series` object which index corresponds to the columns of the `DataFrame`.

When selecting several rows, we obtain a new `DataFrame`: subset of the original one and sharing the index with as many columns.

**With the `.loc[]` operator**

In [104]:
# selection of a row
row = name2017.loc["Emma"] # or name2017.loc["Emma", :]
row

gender        F
births    19738
Name: Emma, dtype: object

In [105]:
# row is indeed a Series object
type(row)

pandas.core.series.Series

## test equality of DataFrame columns and row index
(name2017.columns == row.index).all()

In [ ]:
# selection of several rows
name2017.loc["Olivia":"Isabella"]  # or name2017.loc["Olivia":"Isabella", :]

**With the `.iloc[]` operator**

In [ ]:
# selection of the last row
row = df.iloc[-1] # or name2017.iloc[-1, :]
row

### 3.2.3 Selecting rows and columns in DataFrame

When selecting a single row, we obtain a `Series` object which index is a subset of the columns of the `DataFrame` object.

When selecting several rows, we obtain a new `DataFrame`: subset of the original one.

**With the `.loc[]` operator**

In [ ]:
# selection of a single row and several columns
name2017.loc["Olivia", "gender":"births"]

In [ ]:
# selection of several rows and columns
name2017.loc["Olivia":"Isabella", "gender":"births"]

**With the `.iloc[]` operator**

In [ ]:
# selection of several rows and columns
df.iloc[[0, -1], 1:3]

**Selection when the index is not unique**

In [ ]:
name = df.set_index("name")
name

In [ ]:
# selection of a single index
name.loc["Emma"]

In [ ]:
# selection of a several index
# multiple selection when the index is not unique does not work
# name.loc["Emma":"Mia"]

### 3.2.4 Selection in DataFrame with a boolean mask

It is possible to select in `DataFrame` object with a boolean mask sharing the same index than the `DataFrame`.

The easiest way is to build a boolean `Series` object from one or several columns of the initial `DataFrame` object.

It is possible to combine boolean masks using logicial operations between boolean objects of type `Series`:

- AND is `&`
- OR is `|`
- NOT is `~`

In [100]:
# selection with name equals Emma
mask = (df["name"] == "Emma")
mask

0          False
1          False
2           True
3          False
4          False
5          False
6          False
7          False
           ...
1924657    False
1924658    False
1924659    False
1924660    False
1924661    False
1924662    False
1924663    False
1924664    False
Name: name, Length: 1924665, dtype: bool

In [ ]:
# selection with name equals Emma
df.loc[mask]

In [ ]:
# names used at least 1000 times in a year
df.loc[df["births"] >= 1000]

In [ ]:
# female names used at least 1000 times in a year
df.loc[(df["gender"] == "F") & (df["births"] >= 1000)]

<div class="alert alert-success">
**Exercise 6**
<ul>
    <li>Print years, names and births of all names with only 2 letters.</li>
    <li>How many names do we have?</li>
    <li>Give the list of such names in alphabetical order.</li>
    <li>How many births of persons with names with only 2 letters?</li>
    <li>How many years where the number of births for a name is exactly 1000?</li>
    <li>Are there any years for which the number of births for a name is equal to the year?.</li>
    <li>Give the list of such names in alphabetical order.</li>
</ul>
</div>

In [ ]:
# %load session2/ex_06.py

## 3.3 Testing data

The SSA web site explains:
- To safeguard privacy, we restrict our list of names to those with at least 5 occurrences.
- Name is 2 to 15 characters

We will check these points.

<div class="alert alert-success">
**Exercise 7**
<ul>
    <li>Check that all births are at least 5</li>
    <li>Check that all names have betwen 2 and 15 characters</li>
</ul>
</div>

In [ ]:
# %load session2/ex_07.py

## Summary

The `pandas` module is an open source library providing high-performance, easy-to-use data structures and data analysis tools for the Python programming language.

It introduces 1-dimensional `Series` objects and 2-dimentional `DataFrame` objects to manipulate data.

`Series` objects offer dictionary-like along the index and vector-like accessing to data. They might contains booleans, numbers, time objects and strings and provide appropriate operators according to their type of data.

`DataFrame` objects offer dictionary-like along the index and the columns and also matrix-like accessing to data.

The `.loc[]` operator enables to select data using labels or boolean operations.

The `.iloc[]` operator enables to select data using positions.